#define _CRT_SECURE_NO_WARNINGS
#include "pch.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

void PrintAllUI() {
	printf("\n");
	printf("--------------------------------전체 출력[P]--------------------------------\n");
}

void MainMenuUI() {
	printf("\n");
	printf("--------------------------------전화번호부 인터페이스--------------------------------\n");
	printf("추가[A]  검색[S]  전체 출력[P]  삭제[R]  수정[U]  카테고리 출력[C]  프로그램 종료[X]\n");
	printf("원하시는 명령어를 입력하세요 : ");
}

void RemoveUI() {
	printf("\n");
	printf("--------------------------------삭제[R]--------------------------------\n");
	printf("삭제하고 싶은 이름을 입력하세요 : ");
}

void CategoryUI() {
	printf("\n");
	printf("--------------------------------카테고리 출력[C]--------------------------------\n");
	printf("보고 싶은 카테고리에 맞는 숫자를 입력하세요. 친구[0], 가족[1], 직장[2], 기타[3]: ");
}

void CreateUI() {
	printf("\n");
	printf("--------------------------------추가[A]--------------------------------\n");
}

void SearchUI() {
	printf("\n");
	printf("--------------------------------검색[S]--------------------------------\n");
	printf("검색하고 싶은 이름을 입력하세요 : ");
}

void UpdateUI() {
	printf("\n");
	printf("--------------------------------수정[U]--------------------------------\n");
	printf("수정하고 싶은 이름을 입력하세요 : ");
}
